---
kind: method
id: M:Autodesk.Revit.DB.Analysis.AnalysisDisplayVectorSettings.Dispose
source: html/a5dccb3c-23fc-d40e-79d2-df9d16bcafc2.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisDisplayVectorSettings.Dispose Method

Releases all resources used by the AnalysisDisplayVectorSettings

## Syntax (C#)
```csharp
public void Dispose()
```